[{"title": "Cuando una octava Weasley existe", "author": "severusvonstiltskin", "text": "¿Nunca les pareció extraño que entre Charlie y Percy hayan tantos años de diferencia? Pues, en otro universo, es en esos años que nace Debby Weasley, la niña que va a cambiar el mundo... ¡Tiene los conocimientos de una friki del mundo de Harry Potter, una psicóloga y una musa que la hizo saber más, mucho más de ese mundo que la misma J.k! Y las diferencias inician aún antes de que"}, {"title": "Voldemort's Chosen One", "author": "BazzCatgirl03", "text": "Chosen. Chosen to be a slave. Chosen to have the Dark Lord's child. Chosen to never have a life beyond what the Dark Lord commands. Now, with the help of a select few at Hogwarts, she must find a way to escape her destiny or die trying. CURRENTLY BEING REWRITTEN."}, {"title": "Ojos Negros", "author": "MoonstoneAndStarDust", "text": "El me ofreció su mano y yo la tome porque al final del día, por muy oscuro que sea el Lord siempre necesitara a su Lady a su lado"}, {"title": "The Return Of The Marauders Part I: Truths Revealed", "author": "Kaorugloomy", "text": "After hearing the truth from 3 of his teachers about the death of his parents. Harry Potter decides to investigate further. And after taking the advice of his older brothers, uncovers a shocking truth about the death of his parents. Resolved to free his godfather, he sets out on a journey to pull together the family he wanted. Time travel, good Draco and Dursleys, Percy bashing."}, {"title": "Patience is a Virtue", "author": "Sapphire Diadem", "text": "Follow Lily, Hugo, and Louis as they attempt to make sense of life and love while also dealing with their families and heading back to Hogwarts for another year, and it promises to be an interesting one. A sequel/companion/spinoff of Show a Little Faith and Leap of Faith."}, {"title": "¿Puedo tomar su orden?", "author": "ItsCatherine", "text": "Harry Potter esta enamorado de su mejor amigo Ronald Weasley y estaría dispuesto a seguirlo a donde fuera, aunque eso signifique conseguir un empleo en una cafetería para conquistar a la chica que le gusta al pelirrojo. Una vez dentro se encuentra con cierto rubio que le ayudara a superar su amor unilateral. Coffe Shop AU."}, {"title": "Scion to the Noble and Most Ancient House of Beaudelaire", "author": "LeFoxxx", "text": "Anthonie de Bousquet, son to the Marquess of Beaudelaire, is able to attend Hogwarts through an ancient bylaw in the school's rules. Years 1-4. Researched Lordship trope. Focus on international affairs, history of the Wizarding World and world-building. Detailed magical lessons. No romance until fourth year. Complex family tree. Non British main character. Multilingual characters"}, {"title": "It Was Only Potions: Drarry", "author": "shortiegirlie1016", "text": "A love story about Harry Potter and Draco Malfoy. They get partnered up in Potions! What potion will they make? Will they be friends... Or more than friends? Find out!"}, {"title": "Calla Potter", "author": "islandgirl394", "text": "AU. Calla Potter has always been hiding. From bullies, from the Dursleys, from the teachers who only ever noticed when she didn't pay them rapt attention. But she is also the twin sister of Harry Potter, the so-called Boy Who Lived, and when they begin at Hogwarts, she must come out of the shadows and face the world, no matter what it means for her."}, {"title": "The Magic Circle: The Forgotten Witches", "author": "Karen Killa", "text": "Two fourteen American girls who have been best friends since a young age have discovered something more to their lives on Halloween night. When Tammie Allen decides to stay at her best friend Melinda Sawyer's house for a Halloween movie marathon and candy things take a turn sudden turn when a mysterious fog washed over the house and causes everything to appear frozen. Upon some c"}, {"title": "Tales of a Muggle Studies Teacher", "author": "prongsletfanfiction", "text": "When their muggle studies professor retires, Hogwarts decides to try something they've never done before: hire a muggle to teach muggle studies. Katie Harris is a muggle fresh out of school and looking for a job - any job. When she applies to teach at Hogwarts, she has no idea what she's getting herself into. But maybe, just maybe, it'll be the best decision she's ever made."}, {"title": "Lupin And Weasley", "author": "Carrow Alecto", "text": "How Teddy and Victorie's relationship develops during their time at Hogwarts."}, {"title": "Sœur Black", "author": "InkedRose", "text": "Aquilea Black est la jeune sœur de Sirius et Regulus, par sa présence elle va changer bien des choses, avec un principal objectif en tête : protéger sa famille."}, {"title": "Harry Potter and the Life Beyond", "author": "reviews", "text": "This story picks up from the moment the HP books ended, but before the epilogue. What happens to Harry and his friends now that the war is ending? Grief fills their hearts. But there is more to it, there is still hope. Completely Canon."}, {"title": "Only politics", "author": "immortalsorcerer", "text": "Sequel to Only Slytherin, 3rd part in series. Featuring 3rd year in Hogwarts."}]