[{"title": "Lómring", "author": "reviews", "text": "Holly thought she felt the stinging cold of a snowdrift pass under her fingertips. Her eyes fluttered open, and she furrowed her brow, frightened that someone had been watching her. There was no one else in the room, of course. But her sudden, irrational fear was a painful reminder that things weren't over—not by a long shot. [Part Two of the Iron and Ice Series]"}, {"title": "Tarnished Silver", "author": "drizzleandflames", "text": "Two things in her life she had never been able to ignore. The shadows of the past and the call of a wizard. / Gandalf goes over Thorin's head and recruits a druid to join them on the quest for Erebor. She turns out to be a valiant addition, though there is trouble of a different kind she might stir up. / Fili/OC"}, {"title": "Wild Magic", "author": "Artemisdesari", "text": "Ravens are large birds and this raven is bigger still, perhaps a little more than two and a half feet long which could be considered a considerable size to a hobbit of only three feet and eight inches. For Billana Baggins, outcast and feared for her strange magic, this raven could signal that start of a new life, provided she survives the journey towards it."}, {"title": "Through Books and Worlds", "author": "Kali.Incarnate", "text": "Welcome to modern Washington. Ellie is a recluse fiction writer who enjoys reading fanfiction on the side. One day, three men appear in her study who look just like the actors from the Hobbit and dress like them. What and how did this happen? Did she hit her head and land in a coma? Strap in for humor and romance with Ellie, the Durin's, her best friend and animals. F/OC/K Thori/OC"}, {"title": "Love has two sides", "author": "Bindi-the-skunk", "text": "Brine looked at him with fear in her eyes. Luckily, her false beard hid the pallor of her face. \"I don't know what you're talking about, Fili.\" Fili looked at her with a strange shadow in his eyes. \"You have to tell him the truth, Pip.\" One more look was enough to confirm Brine's suspicions. Fili knew who she really was."}, {"title": "All I ever wanted all I ever needed", "author": "thatskasterborous", "text": "Bilbo dies, but is sent to an alternate world that has everything he could ever want or need MPREG warning and some drama later on"}, {"title": "Where Your Heart Lies", "author": "kjate95", "text": "Their worlds had merged momentarily, reality shattering at a single point. The walls of the two worlds melting together until something broke through. 20 year old Leah Orrison was camping with her Mother when an unexpected visitor crashed into their camp site. Now she has to deal with the fact that Middle Earth is very real and that there is a very real dwarf who needs her help."}, {"title": "The Soldier of Erebor", "author": "ThickerThanLove", "text": "\"It is not if I get caught... it is when.\" Under the disguise of a man, Lyra Fraser signs up for the City of Dale guard in an attempt to save her family from starvation come winter. But when the Dwarf kingdom of Erebor calls for aid from Dale, Lyra begins to realize that her plan may be much more complicated than she'd initially anticipated. Romance/adventure. Inspired by Mulan."}, {"title": "Deafening Silence", "author": "Rayan du Griffoul", "text": "Bilbo has returned to the Shire after spending the winter in Erebor. He saw his friends recover and Thorin take the throne. He did what he set out to do. So why does Bag End feel so empty? Continuing out of popular demand! No longer a one shot!"}, {"title": "Le fantassin et la reine", "author": "MerlinOfTheShire", "text": "Antoine Fabregat un soldat français meurt lors de la bataille de Sedan (1870) mais on lui offre la possibilité de vivre dans un autre monde. Il ne se doute pas de ce qui l'attend, surtout lorsqu'il fait la rencontre d'une bande de nains et de leur cheffe."}, {"title": "Middle What? REWRITE!", "author": "griffindork93", "text": "When you are a vampire, getting sucked into a book vortex isn't really on your to-do list. After all, a Vampire must not show their wings to those who only feel greed for things that are beautiful. STORY HAS BEEN CANCELED. This was the first thing I ever wrote so I won't try to improve it."}, {"title": "There and Back Again: A Second Chance", "author": "Hobbsy3", "text": "When Bilbo woke, he knew something was wrong, because he was without a stitch of clothing. He was a respectable Hobbit. A Baggins of Bag End. He did not sleep naked."}, {"title": "Dark Side of the Moon", "author": "Nuala Thranduiliel", "text": "When the peace of the Shire is shattered by a frantic wizard and Darkness falls upon Erebor, the patchwork family of Kili Baggins is thrown into chaos. Sundered by distance and duty, they must each play a part in the war revolving around the Ring that has long dwelt in Bilbo's pocket. But a conspiracy forms in the shadows and the Ring vanishes, putting the whole world at stake. T/M"}, {"title": "Une aventure elfique", "author": "Aslan's Princess", "text": "Un groupe d'elfes apparaît dans les jardins de l'Elysée et provoque la pagaille dans la vie de Laure. Des arrivées inattendues, des histoires d'amours et de nombreuses relations inter-espèce sont au programme de cette épopée fantastique."}, {"title": "The Two Hobbits", "author": "lindir's gaze", "text": "Bilbo and Bellarosa Baggins are twins, but they couldn't be more different than night and day. Bilbo is a Baggins, through and through. Bella is a Took, wondering what lies beyond the Shire. So what happens when Gandalf the Gray comes along with the offer of an adventure?"}]