[{"title": "Sacrifice", "author": "Lea Valdez", "text": "[FINNICK ODAIR x OC] One Hunger Games was enough to drive me mad, leave me with enough awful memories for a lifetime, leave enough scars on my body. But the Third Quarter Quell announcement ruined the little sense of security I had left after walking out of the bloody arena. I had to go back in. This time, with people I knew and loved. SLOW UPDATES"}, {"title": "The Price of Freedom", "author": "reviews", "text": "They say no one truly wins the hunger games - they just survive. Maria swore a Hippocratic Oath in the footsteps of her mentor and vowed to spend her life saving as many people as possible. That was hardly about to change because of a tiny piece of paper. She wasn't going to play the capitols game, but if not her, could district 12 still have a victor?"}, {"title": "Full Moon", "author": "Syraxes", "text": "The year is 2020. Chicago high school students are going on a field trip to a mysterious island off the coast of California, but when they arrive at the resort, what happens when an old myth turns out to be more like a game? {open SYOT}"}, {"title": "Mentor", "author": "TheNoobyBoy", "text": "\"This trip doesn't end when you get back home. You never get off this train.\" - Haymitch Abernathy, Catching Fire Film. At the age of thirteen, Gale Hawthorne won the Sixty-Nine Annual Hunger Games and became the youngest Victor in history. As District 12's third Victor, he'll be allowed to live his life in luxury, while being condemned to mentor an unlucky tribute every year."}, {"title": "Evil Spirits: The Revamped Hunger Games 2 (SYOT OPEN)", "author": "66samvr", "text": "Evil Spirits. We all have them. They are deep within our soul. We try to say we are perfect, but we are not. The 74th games had a forest. So will the Revamped Hunger Games 2. Except this one will be much, much darker. Evil spirits go in it. This is and a new president by the end of the first revamped games, there is a lot of evil this year. Will the tributes match this? SYOT CLOSED"}, {"title": "Rainbows and Storms", "author": "Loopholes47", "text": "Shy and sensitive, Vera Kingsley always assumed the Hunger Games would never happen to her. Now she's got no choice but to fight her way through this death sentence. Based off AmericanPi's Raindrops. SYOT closed."}, {"title": "Dreamers Live to Die", "author": "jayrob89", "text": "I did the cowardly thing and tried to avoid the future as much as possible, even with all the devastatingly powerful information behind my lips. But alas, fate found its way to bite me in the ass. [SI-OC Gale's twin sister]"}, {"title": "History Still Repeats Itself", "author": "santiago.poncini20", "text": "The Conclusion to the epic entitled \"History Repeats Itself\" by Author of Ice and Fire. Read History Repeats Itself first ; this conclusion is merely a tribute to the epic she created."}, {"title": "Learning to Die: The 117th Hunger Games", "author": "A Proud Bibliophile", "text": "\"Like everyone else, you want to learn the way to win, but never to accept the way to lose, to accept defeat, to learn to die is to be liberated from it. So when tomorrow comes, you must free your ambitious mind, and learn the art of dying.\" - Bruce Lee. It is a SYOT closed to submissions. So come submit! (Collaboration with IIJamesII)"}, {"title": "Caedes: The 27th Hunger Games", "author": "engineerwenlock", "text": "Caedes; or bloodshed, as we know the word in Panem. It's an intriguing word, to be certain. This year, the Hunger Games will bring bloodshed. They will bring terror to the hearts of the tributes and their families. They will bring the never-ending loyalty of the districts. Snow is certain of this. Sanguis tuus erit. Blood will be shed."}, {"title": "Wildcat", "author": "Stephensmat", "text": "Wanted: Joe Mason and Wildcat Everdeen for Train Robbery and Horse Thieving. When a simple trip into town turns into a run-in with a famous outlaw, farmer Peeta Mellark doesn't know if he's in over his head or head over heels."}, {"title": "The Storyteller", "author": "reviews", "text": "Effie let out a long suffering sigh at Katniss' shout. \"I'm sorry, miss; but the time for that has passed. If you wanted to volunteer, you should have said so when it was your turn.\" A canon-divergent Fic: Prompt: What if Katniss wasn't allowed to Volunteer for Prim? Rated hard T for themes, both implied and directly shown. This is the Hunger Games, after all."}, {"title": "The Ballad of Katniss Clones and Leather Pants", "author": "cannedcorndog", "text": "It's the Tenth Annual Hunger Games, and the inexplicably seventeen-year-old Coriolanus Snow is assigned to mentor a District 12 female tribute named Sagittaria Denver. Never mind that Snow grows up to be an evil dictator - here he is totally a sympathetic hero, y'all! Contains criticisms of and predictions for The Ballad of Songbirds and Snakes - don't like, don't read."}, {"title": "Real This Time", "author": "Audmirable", "text": "It's the Third Quarter Quell and Gale can't let Katniss do it alone, or even with Peeta, so he volunteers, forsaking his family's needs. This time, Katniss chooses not to rely on the sympathy of the crowd, but her own strength, and the strength she has in Gale. Together, they just might succeed.-bad summary, I know. Hopefully it's better to read."}, {"title": "Desolation: The 93rd Hunger Games", "author": "jhuniemarieilarde", "text": "Eighteen years after the failed rebellion, the Capitol is still in power. The Hunger Games have continued, now on it's 93rd cycle. As twenty four new tributes prepare for the fight of their life, one question has started to spread like wildfire: is there any way to change things? SYOT, closed"}]