[{"title": "The Last Cúthalion", "author": "feaedhel-celebdae19", "text": "This is a fantasy story I wrote for writing class. Hope you all enjoy it! (This story does tie into my other story, \"Cúthalion\")"}, {"title": "Forest, My Home", "author": "roihu678", "text": "The songs of the cones and the talk of the needles filled the forest air. Wind in her veins, stealth in her toes, blaze in her heart, she listened to her soul trees humming. The dark green spruces spoke her language. / Slow romance, based on friendship. Post-LotR. Legolas/OC (female elf)"}, {"title": "What It Means To Be A King", "author": "Arinariel", "text": "No one is born great and wise, not even the great King Gil-galad or Master Elrond, known throughout Middle Earth for his wisdom and knowledge. For young Thranduil, the road toward wisdom and greatness is fraught with deep-seated anger, sorrow and remorse. This is a journey through the Second Age seen through the eyes of Thranduil, Gil-galad, Elrond and Sauron."}, {"title": "Dusk", "author": "Jedi Sapphire", "text": "It may be concealed for centuries, but eventually truth must out - no matter how much damage it does along the way."}, {"title": "27 - Survival of the king or Survival of the kingdom", "author": "DixieLeDix", "text": "Gondor and Arnor drift apart. Facing new challenges. But help is coming from the west"}, {"title": "Chosen of the Valar", "author": "Mystic Lady Fae", "text": "Dropped into Middle Earth against her will, Alyssa is lost and confused. Even worse, she's arrived decades before the famous Fellowship is formed. What are the Gods up to? Why is she here? (Set before and during The Hobbit and Lord of the Rings.)"}, {"title": "Visions of Gold", "author": "1leaderinred1", "text": "When a young girl fights a fiery beast in a nightmare, she thinks that the blond stranger that she cradles as he dies is but a figment of her imagination. Soon however, she finds herself in Middle Earth among characters far darker than the fiction she loved. Dark premonitions lead to her being thrust from the role of captive to captor as she meets her stranger once more."}, {"title": "Walking In Worlds Beyond", "author": "PegasusWingsVW", "text": "After finding an odd little boy hiding in her parents barn, Emily Harris is swept from her ordinary life on earth into a tale of portals between worlds, finding a family that she never knew existed and reuniting them across worlds, magic, healing, growing up, life lessons and finding one's place in a greater story. A coming of age story. Also featuring Elrond and Glorfindel."}, {"title": "Naked Greenleaf", "author": "Nadiafarjana", "text": "Dear Eru,we have not only lost the prince,we have lost a naked prince. The king will be furious."}, {"title": "Beyond the Unknown", "author": "H. M. A ChocoC", "text": "Unprecedented circumstances lead Lanette down a novel fate. Finding herself in a world overrun by peril and teetering on the brink of devastation, she tries to find her way home for her own salvation. But as unexpected circumstances arise, she is forced to rethink her priorities and choices, while learning, along the way, what it means to truly live and love. OC. Pre to post Lotr."}, {"title": "Branwyn's Bits and Pieces", "author": "LadyBranwyn", "text": "More short fics and drabbles.  Characters include Beregond, Boromir, Aragorn, Faramir, and others."}, {"title": "Your Light in the Dark", "author": "Mirrordance", "text": "In a dark forest, dark secrets have plenty of hiding places. While in Mirkwood on a mission to investigate the growing evil of Dol Guldur, Glorfindel works with the son of Elvenking Thranduil. But all is not well with the war-hardened soldier, prince Legolas... Warning: Slash / Dark Themes"}, {"title": "Glorfindel's Last Hurrah", "author": "Wynja2007", "text": "When Glorfindel has a prophetic dream suggesting his friends in Eryn Lasgalen are in trouble, of course he sets out to help. And, of course, his friends in Rivendell refuse to let him go alone... Please note this story also develops the Triwathon-and Parvon-in story arc in the latter stages, but Glorfindel will return. This story predates 'The Last Ship Ever' & 'Chasing Ships'."}, {"title": "A Light in Midwinter", "author": "MirkwoodmaidenAlso", "text": "Second in a series of stories of the Winter Solstice in Middle Earth. Loved ones gather in Ithilien to celebrate the Solstice and to share Faramir and Eowyn's joy as Eowyn is about to give birth. Chapter THREE. Boys in a Pub discussing the strange and mysterious beings known as...their wives."}, {"title": "All Those Who Wander", "author": "StraitjacketChic", "text": "On a moonlit shore, a lady of Numenor stumbles upon a Teleri minstrel. In a city under threat, an elf lord meets a bastard in a red bandanna. In the midst of a civil war, a shipbuilder meets a sea serpent. On a quiet road, an enchantress meets a gray wanderer. \"I do not know who you are, dear stranger, but I would follow you to the ends of the Earth.\""}]