[{"title": "Kind of Chasing Clary (But not Really)", "author": "reviews", "text": "She looked back to find Liam, but he was gone. Smart move, she thought. \"What were you going to say before the whole, 'I was beating him up because I love you speech?\" \"Clary, we're not related.\" \"Great! Now could you stop beating up my date?\" Clace."}, {"title": "outcast angels", "author": "ClaceandStelenaTMITVD", "text": "Clary takes a moment to study the Voyance rune on the back of her hand. [Character Study]"}, {"title": "Just a Dream", "author": "SereneCalamity", "text": "It started out great but ended bad. Clary was glad it was just a dream. Clace Fluff Oneshot"}, {"title": "Taken In", "author": "SereneCalamity", "text": "Caspian's parents were killed while she slept. Her uncles take her in. She fights them, wanting to be elsewhere, but comes to tolerate them. My own OC. Rated T for talk of death and slight language."}, {"title": "Lost, Forgotten, Found", "author": "Pokemon67", "text": "Clary and Jace were best friends. While they were children they got into a car accident and Jace doesn't remember her. She returns to Alicante; finds her father has started a war; her mother gets a warlock to erase her children's memories. She's sixteen now. What happens when she encounters people from her past and truths are revealed? *EDITING SO DELETING ORIGINAL CHAPTERS*"}, {"title": "Pressing Play (Rewind and Repeat)", "author": "Jacesangle404", "text": "A second series of song inspired oneshots, featuring around our favourite couples. Requests now closed. Mainly Clace, with Malec and Sizzy."}, {"title": "Breathing Into You", "author": "46AmityBread46", "text": "Clary was a carefree university student, who split her time between classes, painting in her cheap apartment, drinking with her friends, and getting high with an older guy named Jace. Clace."}, {"title": "Remembrance and Redemption", "author": "SivanShemesh", "text": "Max Lightwood is given a chance to return to life and he jumps at the chance. But in order complete the mission the Angels have for him, he is going to need the help of his killer. Meanwhile, Clary is on the verge of getting the memories she lost when Magnus blocked her Sight. Except there might be more than fairy wings and her mother's scars she forgot about."}, {"title": "Rock Star", "author": "Rrrfffggg1234", "text": "Clary is in one of the most popular bands in the world. She is trying to be perfect for everyone, but is the pressure becoming too much? She meets Jace, Hollywood's bad boy, when she films a movie with him. Will they be able to help each other, or will their jobs keep them apart?"}, {"title": "Ten Days Abroad", "author": "LukePoiz", "text": "Clary Fray thought that it would be a good idea to sign up for the British exchange programme at her school. Her thoughts about the exchange couldn't have changed more drastically. Clace. AU. AH."}, {"title": "Jace, Duck!", "author": "t1gerl1ly", "text": "Five times that Alec suffers and has traumatic experiences with spiders and one time that MALEC executes their revenge."}, {"title": "Second Beginnings", "author": "Pokemon67", "text": "After three years at boarding school, 16 year old Clary Fray, must deal with her extremely mixed feelings about her brother's best friend Jace. Three years change a person, has it been for the better, or the worst?"}, {"title": "Vampires Can't Get Pregnant, Can They?", "author": "rainrock17roll", "text": "Simon starts to feel nauseous in the mornings, day after day, and some chat with Clary later, plus a few drugstore tests in between, everything makes sense now. Updates daily, during the whole month. Rating will be updated as the story progress, tags will be added, deleted and modified in the same fashion."}, {"title": "The Pain Of A Good Memory", "author": "The Lovelorn Lovelace", "text": "I don't really know how to explain it, you just have to read it. Rated T for a lot of drinking and depressing stuff."}, {"title": "Family", "author": "FossilRuins", "text": "Summary: Jocelyn Fairchild left after the Uprising, leaving her dead son and fanatic husband in the past. She is alone with her daughter, determined to raise her in safety. But what will she say when she is told Jonathon Christopher is alive? Will she be wiling to compromise Clary and her own safety for a child with demon blood?"}]