[{"title": "Neighbours", "author": "grover.is.bae", "text": "High School a.u. (not demigods)-Percabeth Percy moves to San Francisco with his mom. He notices the blonde girl who lives next door, and is immediately attracted to her. He wants to tell her but how? With school, and girls, and all the drama, how will this even work?"}, {"title": "Reading the Books - The Lightning Thief", "author": "Clockworksoldiergirl", "text": "CHB, Camp Jupiter, the gods, satyrs, hunters, Amazons, and more get together to read the story of the brave demigods who risked their lives. The Feast of Fortuna is now being held at CHB where the books will be read. A few weeks together ending with the feast. What will change between the demigods and what secrets will be revealed?"}, {"title": "How To Save A Life", "author": "Sarcasticsnark13", "text": "DO NOT READ UNLESS YOU ARE ALL CAUGHT UP WITH TRIALS OF APOLLO. This fanfic is set during the events of Tyrant's Tomb. Reyna has always put her leadership duties before everything else. Then, the worst news reach her and it's time to say goodbye."}, {"title": "Here we go again", "author": "louisa.m.kruger2000", "text": "Rampaging monsters. A rouge god. And enough trouble to fill a swimming pool. The same old heroes that we all love. Set after HOO if TOA hadn't happened. T for saftey."}, {"title": "Love me Never", "author": "Momentei", "text": "I don't know what to think. Life's not peaceful, but at least you know it's going to end. Death isn't peaceful either, no matter where you go. I'm proof. But now I have a second chance at life. What could go wrong?"}, {"title": "Future meets the past", "author": "Zeebo20", "text": "After Jason, Piper and Leo complete there quest in the Lost Hero; they along with Annabeth, Nico, Grover, Thalia and Rachel get sent back to the day Luke stole the lightning bolt and helm of darkness. The gods and kids of the future are forced to sit down and read about what is to come. Time outside of Olympus is frozen."}, {"title": "Percy Jackson and the Lost God", "author": "Shadeslayer113", "text": "Percy Jackson was a normal kid until he was thrust into a world of myths and monster. Now facing off against monsters that want to eat him and gods that mess with his life. At least he has help from the insanely powerful voice in his head. Rated t for swearing and violence"}, {"title": "Child of the Night", "author": "Opressor", "text": "OC character who is the child of the primordial Nyx. With Gaia trapped by the giants Percy may need more help than he thinks. The primordials decide to send Eclipse to help Earth against the looming threat. Takes place before TTC. Starts off following the original plot but as the story progresses it will deviate more."}, {"title": "Hector and the Titans of Othrys: The Cursed Blade", "author": "MyAliasIsAnonymous", "text": "Hector, the Son of Kronos, grew up ignorant of his heritage and loyal to the Olympians. When events at home drive him to camp, he finds himself being pulled headfirst into a conflict he had once considered distant and forgotten. Joined by Diego and Serenity, he must survive the struggle between Titans and Gods that wish to influence his destiny. Multiple OC's. AU"}, {"title": "The Son of Chaos and Poseidon", "author": "The Lil' Lion", "text": "Percy was never Sally Jackson's son. His mother was someone else. His mother is Chaos and after the war with Gaia, the gods try to kill him, he is rescued by his mother. Years later, the Olympians require his help. Will he help them?"}, {"title": "Tales of Midgard: The Great Midgardian War", "author": "ArtemisApollo97", "text": "As the new generation of immortals begin to rise in power, a paranoid Kronus turns to an unlikely source for help in keeping his throne that may end up with the entire planet at stake. Not PJO, but inspired by it, give it a go anyways maybe you'll like it. Book 1 of 3"}, {"title": "Knelt By Her Notebook", "author": "Darkar Sam", "text": "Annabeth Chase... she's a mystery Percy Jackson will never solve. She carries her Leather notebook with her everywhere she goes. She eats lunch alone. She's quiet but also stands up for herself. It was a mistake to read through her notebook. Now she'll hate him even more. (Rated T just in case)"}, {"title": "Trouble is not restricted to Paradise", "author": "NEIWIS", "text": "Leo had only just left. Calypso had decided to potter around, take her mind off things. Oh, she did miss that idiot. But little did she know that trouble came with the tide..."}, {"title": "The Trident Trouble", "author": "Orca2Whale", "text": "Percy Jackson, the son of Artemis has a destiny bigger than many, a destiny that will decide the fate of gods. Loathed by the one who was supposed to guide him, he will alter the course of the story as we know it. How will Percy, one guy in the world of monsters, without anyone backing him up leave his mark on the world. I don't own Percy Jackson and the Olympians"}, {"title": "A Camp Half-Blood Vacation", "author": "PrinceOfHalfBlood", "text": "After the Senate forces Reyna to take a vacation at Camp Half-Blood, Reyna is not what one would call a happy camper. She'd rather be at Camp Jupiter relaxing and making sure nothing burns down. Instead, she is stuck trying to make the best of her situation. When her week starts to look up, a dark magic falls over Camp Half-Blood, and Reyna is one of the few who can stop it."}]