[{"title": "The Unforgivable", "author": "mysteryheart", "text": "What really should have happened when jacob forced himself on Bella and Charlie pleaded indifference. Actions have consequences and i think. its time a couple of stubborn men learned that. Jacob-bashing. Not for jacob lovers ( currently experiencing technical difficulties with my chapters being cut off. please hold on while I try to fic the issue)"}, {"title": "The unforgivable: Missing scenes", "author": "jovita.maciasruiz", "text": "here are the missing scene's from my story The unforgivable"}, {"title": "seduciendo a un padre", "author": "Sami1997", "text": "Una chica obsesionada con un padre, primero es una aventura y luego se convierte en amor"}, {"title": "Heartbeat", "author": "Clara370", "text": "Something is going on with Esme, she is crying, is warm, and can't hear as well"}, {"title": "How To Say Goodbye", "author": "airedalegirl1", "text": "Sam and Emily have settled down and married. They are looking forward to a well earned happily ever after. Everything was perfect until tragedy struck. Will Emily survive or will Sam have to say goodbye to his reason for existing?"}, {"title": "Âmes soeurs", "author": "siriuslymerlin", "text": "\"As-tu déjà entendu parler d'imprégnation ? C'est plus fort qu'un coup de foudre… Ça ressemble à la gravité. C'est l'union parfaite. Lorsque tu vois ton âme sœur, c'est comme si tu ne dépendais plus de l'attraction terrestre, mais de celle qu'elle exerce sur toi.\" Mon souffle se bloqua dans ma gorge. \"Âmes sœurs ? Toi et moi ?\" Il acquiesça. Je devais être maudite."}, {"title": "A Christmas Wish", "author": "siriuslymerlin", "text": "All of Bella's dreams come to nothing when she feels that she has lost everything that matters. She's alone even though surrounded by family and contemplating ending it all when a Christmas wish comes true. J/B"}, {"title": "Dreams", "author": "HWALC", "text": "Leah character development drabble. Mostly her inner musings. Rated K"}, {"title": "Sunlight Filtered Through Green Leaves", "author": "NikkiB1973", "text": "A gay twilight rewrite set in the late twenty-teens, with a hopefully refreshing twist! Forks is a nothing town, a hikers pit stop before they descend into the mass of green forest that threatens to engulf the Olympic Peninsula. Beau Swan doesn't expect anything from it, but then again, the universe has always conspired to prove him wrong."}, {"title": "My Hands are Shaking from Holding Back From You", "author": "Littlerainbowfish", "text": "Kim Conweller hadn't expected much out of high school, past a degree. She's pretty invisible, and that's the way she likes it. Suddenly, she's not so invisible anymore and the person looking at her is the last person she'd expect."}, {"title": "The Unknown", "author": "Seph Meadowes", "text": "The Blakewoods don't expect much to change when they move to Tennessee. they keep what they are a secret from the Cullen's, but when their life unexpectedly gets turned upside down, do they tell them? Will the Cullen's help? Will they be able to?"}, {"title": "Snap Decision", "author": "jazzandbells", "text": "This is my Christmas story set in New Moon AU."}, {"title": "DEATHSPELL", "author": "Ari's World", "text": "ORPHAN BELLA SWAN IS FOUND BY LONG LOST RELATIVES AND TAKEN TO THE DESOLATE TOWN OF BLACKSVILLE, WEST VIRGINIA. THE CULLENS ARE STRANGE AND MYSTERIOUS, ESPECIALLY HER \"SORT OF\" COUSIN EDWARD. HE SEEMS DETERMINED TO KEEP HIS DISTANCE. LUCKILY A CUTE DRIFTER CALLED JAKE TAKES HER MIND OFF OF HIM AND THE SPOOKY EVENTS THAT BEGIN TO UNFOLD."}, {"title": "Valerie", "author": "cupcakeriot", "text": "Val and Paul were high school sweethearts. He broke her heart when he first phased, six years later shes back to take care of her sisters and falling back in love with Paul was not on her list to do."}, {"title": "Equinox", "author": "Tigaier", "text": "Angela Weber was the pastor's daughter, the girl next door, and everybody's friend. She was not the object of romantic interest or the middle of a love triangle. Fate had other plans. [No Bella.]"}]