[{"title": "Burning Blue (Remake)", "author": "Crimson.Raspberry", "text": "Bluefur is a newly made warrior of ThunderClan. After a strange dream when she was an apprentice, she had been deeply troubled. But one day she finds a mysterious ginger tom wondering the border of ThunderClan's territory, and everything changes. (Remake of Burning Blue)"}, {"title": "24 Hours", "author": "Icye", "text": "Moons have changed the clans immensely. As battle after battle scars the earth, emotions distort reality and fate's every breath spells venom. In the meantime, a sun falls. The moon rises. And everything is bathed in ᴅᴀʀᴋɴᴇss. (1 drabble a day. . . a challenge of sorts)"}, {"title": "Warrior Cats Loops", "author": "Scoddri", "text": "Time is repeating infinitely for Rusty, and he doesn't know why. His friends join him, and hilarity ensues. Time loop stories for Warriors. All Warriors characters belong to the Erin Hunters. All other characters belong to their respective owners."}, {"title": "Change", "author": "The Forest Dog", "text": "It can be hard to change. Even harder when one is forced to do so. Because if he doesn't change, there may not be anything left to change for. (Do not read unless you know what the Dark Forest is. Rated T because this is Warriors, and there will be blood. Takes place in lake territory.)"}, {"title": "Five Truths", "author": "KatieK101", "text": "Five Truths : Willowbreeze - In death, she watches over Crookedstar faithfully. She waits for him by herself, and then with Willowkit and Minnowkit; and then with Shellheart and Oakheart; and then with Silverstream. (one-shot series)"}, {"title": "Snowstar's beginning", "author": "yeetledee", "text": "Snow was an average kittypet. She had a nice home, a loving twoleg, food, and friends. Their is also Grim. A runaway bloodclan warrior in search of a home with some some of his clanmates. But what would happen if their paths crossed? Follow Snow on an amazing journey to find a place for their clan. And who knows, they might even meet the clans by the lake."}, {"title": "Warriors High", "author": "KT-FeatherSage", "text": "Welcome to Warriors High! The place to learn and play, though do you really trust that? No. No one is safe, three gangs lie in wait of their victims, and people are starting to disappear. And they want to kill. Nowhere is safe. But yet everything is fine, we have the couples, the good grades, everything for a normal life. Confused? Cool! Jump right in! Next stop, Warriors High!"}, {"title": "WARRIORS POETRY - EVERY KIND", "author": "Silver Speaker", "text": "Enjoy poems about your favorite warrior cats! Anything from songs to rap battles to flat-out poems. Enjoy!"}, {"title": "Warriors: Trans-Siberian", "author": "Joseph Ida", "text": "Molewhisker embarks on the longest trip he has ever taken, from Vladivostok to St. Petersburg, he rides the train of luxury. However a series of events unfolding on the train will lead the trip in disaster. Can Molewhisker find out before it all collapses? Warriors belongs to their owners. Train Journey AU."}, {"title": "STOLEN", "author": "Wolfstar Of RavenClan", "text": "Two kits swapped on the same night, each one growing up in the other's life. One grew up with suspisious looks casted his way, while the other grew up in a life that pushed him to his limit. (Another... OC submit)"}, {"title": "Bloodclan Warrior", "author": "Eam4745", "text": "Bloodkit was born in Bloodclan,the most feared clan in the alleys. Will she prove her worthiness to the bloodthirsty leader, Scourge, or die a forgotten death."}, {"title": "Fireheart? No Flame", "author": "Jenava293", "text": "Fireheart is driven out by his clan after preventing a battle with Windclan. Fleeing to the safety of Twolegplace, Fireheart comes across a new clan. A new family. Bloodclan. But what he finds is not what he, or anyone else expects."}, {"title": "Into the Fire", "author": "Akitsune Lune", "text": "The four kingdoms of Thundria, Wynnd, Rivier, and Shodawa are facing dangers like nothing they've ever seen. Their salvation might just lie in the boy with hair of flames. Into the Wild, set in a fantasy world with magic and gender confusion. Rated T for Sandpaw's colourful vocabulary. (Book 1 of Warriors Kingdoms: The Prophecy Begins)"}, {"title": "Darkside (A Warriors Fanfic)", "author": "reviews", "text": "Fate. It gives us our lives, and takes them as well. But sometimes, you have to take control instead. Brushpaw, with a serious injury, does the only thing he can. He shoves fate aside, and takes the wheel. Rated T because it's Warriors, after all."}, {"title": "Vindication", "author": "Hissing Willows", "text": "The Clans have had a moon of peace since the Dark Forest Battle. Old grudges and distrust are hard to dispel, however. When cats from all Clans are brutally murdered, blame naturally falls to the surviving trainees. While the leaders scramble to maintain what remains of their truce, old trainees are forced to band together to find the true murderer - before someone else gets hurt."}]